tsung/join_exit_room.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
        <!-- Client side setup -->
        <clients>
                <client host="localhost" use_controller_vm="true" maxusers='1500'/>
        </clients>
        <!-- Server side setup -->
        <servers>
                <server host="hyhyh-test.jm8qqevcmb.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
        </servers>
        <load>
                <arrivalphase phase="1" duration="30" unit="second">
                        <users arrivalrate="1" unit="second"/>
                </arrivalphase>
        </load>
        <options>
                <option name="global_ack_timeout" value="2000"/>
        </options>

        <sessions>
                <!-- Register and go to lobby site -->
                <session name="register-lobby-join" probability="100" type="ts_http">

                <setdynvars sourcetype="random_string" length="10">
                    <!-- Randomly generate the username -->
                    <var name="username" />
                </setdynvars>

            <request subst="true">
                    <dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
                    <http url="/signup" version="1.1" method="GET"></http>
            </request>

            <thinktime value="2"></thinktime>

            <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                    {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                    edoc_lib:escape_uri(binary_to_list(Val)) end.">
                    <var name="escaped_authenticity_token" />
            </setdynvars>

            <!-- Create the random account and get the userid -->
            <request subst="true">
              <dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
                    <http url='/users'
                            version='1.1'
                            method='POST'
                            contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Create+Account'
                            content_type="application/x-www-form-urlencoded"/>
            </request>

            <thinktime value="2"></thinktime>
            <setdynvars sourcetype= "random_number" start="760" end="800">
              <var name="random_room" />
            </setdynvars>

            <!-- Go to lobby and join room-->

            <thinktime value="2"></thinktime>

            <request subst="true">
                <dyn_variable name="roomid" re="[Ll]ocation: http://.*/videorooms/([0-9]+)"></dyn_variable>
                <http url="/users/%%_userid%%/join"
                                        version="1.1"
                                        method="POST"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%&amp;search=%%_random_room%%&amp;id=%%_userid%%"
                                        content_type="application/x-www-form-urlencoded"/>
            </request>


            <thinktime value="2"></thinktime>
            <request subst="true">
                <http url="/users/%%_roomid%%/exit"
                  
                                        version="1.1"
                                        method="POST"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%"
                                        content_type="application/x-www-form-urlencoded"/>
            </request>
            
            <!-- Logout -->
            <request subst="true">
                    <http url="/logout" method="DELETE" />
            </request>
    </session>
  </sessions>
</tsung>