tsung/newmsg.xml
<?xml version="1.0"?>  
<!DOCTYPE tsung SYSTEM "/home/haowen/opt/tsung-1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">  
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="60000"/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users maxnumber="1" arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/cable"/>
      </request>

      <request subst="true">
        <websocket type="message" frame="text">
          {"command":"subscribe","identifier":"{\"channel\":\"RoomChannel\"}"}
        </websocket>
      </request>

      <for var="i" from="1" to="2" incr="1">
        <thinktime min="1" max="2" random="true"/>
        <request subst="true">
          <websocket type="message" frame="text">
            {"command":"message","identifier":"{\"channel\":\"RoomChannel\"}","data":"{\"room_id\":%%_room_id%%,\"content\":\"tsung\",\"action\":\"send_message\"}"}
          </websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>