tsung/register-retrive-edit-logout.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
	<!-- Client side setup -->
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers='1500'/>
	</clients>

	<!-- Server side setup -->
	<servers>
		<server host="0.0.0.0" port="3000" type="tcp"></server>
	</servers>

	<load>
		<arrivalphase phase="1" duration="120" unit="second">
			<users arrivalrate="10" unit="second"/>
		</arrivalphase>
	</load>

	<options>
		<option name="global_ack_timeout" value="2000"/>
		<option name="ports_range" min="3001" max="8192"/>
	</options>

	<sessions>
		<!-- Register as a new user. -->
		<session name="register-edit-logout" probability="100" type="ts_http">
			<!-- Randomly generate the username and password -->
			<setdynvars sourcetype="random_string" length="10">
				<var name="username" />
				<var name="password" />
			</setdynvars>

			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/signup" version="1.1" method="GET"></http>
			</request>

			<!-- Create the random account and get the userid -->
			<request subst="true">
				<dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
				<http url='/users'
					version='1.1' 
					method='POST' 
					contents='authenticity_token=%%_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=%%_password%%&amp;user%5Bpassword_confirmation%5D=%%_password%%&amp;commit=Create+Account' />
			</request>

			<!-- Go to the settings page -->
			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/users/%%_userid%%/edit" version="1.1" method="GET"/>
			</request>

			<!-- Update user's profile -->
			<request subst="true">
				<dyn_variable name="authenticity_token"></dyn_variable>
				<http url="/users/%%_userid%%"
					version="1.1"
					method="PATCH"
					contents="authenticity_token=%%_authenticity_token%%&amp;username=%%_username%%&amp;avatar=http://www.github.com&amp;originalpassword=%%_password%%;&amp;email=%%_username%%@gmail.com" />
			</request>

			<!-- Logout -->
			<request subst="true">
				<http url="/logout"
					version="1.1"
					method="DELETE"
					contents="authenticity_token=%%_authenticity_token%%" />
			</request>
		</session>
	</sessions>
</tsung>